Repository: sushain97/apertium-monorepo-svn-82937
Catalog: incubator/en-ga-corpus/tmx/1922-1.tmx
Source language: en
Languages: ga

source: CONSTITUTION OF THE IRISH FREE STATE (SAORSTÁT EIREANN) ACT, 1922 AN ACT TO ENACT A CONSTITUTION FOR THE IRISH FREE STATE (SAORSTÁT EIREANN) AND FOR IMPLEMENTING THE TREATY BETWEEN GREAT BRITAIN AND IRELAND SIGNED AT LONDON ON THE 6TH DAY OF DECEMBER, 1921
ga: ACHT CHUN BUN-REACHT DO SHAORSTÁT ÉIREANN D'ACHTÚ AGUS CHUN AN CONNRADH IDIR AN BHREATAIN MHÓIR AGUS ÉIRE DO SIGHNÍODH I LUNDAIN AR AN 6ADH LÁ DE MHÍ NA NODLAG, 1921, DO THABHAIRT CHUN CRÍCHE

source: DÁIL EIREANN sitting as a Constituent Assembly in this Provisional Parliament, acknowledging that all lawful authority comes from God to the people and in the confidence that the National life and unity of Ireland shall thus be restored, hereby proclaims the establishment of The Irish Free State (otherwise called Saorstát Eireann) and in the exercise of undoubted right, decrees and enacts as follows:—
ga: DÁIL ÉIREANN 'na suidhe mar Dháil Bhunaidh sa Pháirlimint Shealadach so, á admháil gur ó Dhia a thagann gach údarás dleathach chun na ndaoine agus muinghin aice gur mar seo a tabharfar thar n-ais beatha agus aontacht Náisiúnta na hÉireann, fógrann sí leis seo bunú Shaorstáit Éireann agus de bharr lán-chirt gan dearmad dineann sí a reachtú agus a achtú mar leanas:—

source: The Constitution set forth in the First Schedule hereto annexed shall be the Constitution of The Irish Free State (Saorstát Eireann)
ga: Is é an Bun-reacht atá leagtha amach sa Chéad Sgeideal a ghabhann leis seo a bheidh mar Bhun-reacht do Shaorstát Éireann

source: The said Constitution shall be construed with reference to the Articles of Agreement for a Treaty between Great Britain and Ireland set forth in the Second Schedule hereto annexed (hereinafter referred to as "the Scheduled Treaty") which are hereby given the force of law, and if any provision of the said Constitution or of any amendment thereof or of any law made thereunder is in any respect repugnant to any of the provisions of the Scheduled Treaty, it shall, to the extent only of such repugnancy, be absolutely void and inoperative and the Parliament and the Executive Council of the Irish Free State (Saorstát Eireann) shall respectively pass such further legislation and do all such other things as may be necessary to implement the Scheduled Treaty
ga: Léireófar an Bun-reacht roimh-ráite maille le aith-fhéachaint ar na hAirtiogail Chó-aontuithe do Chonnradh idir an Bhreatain Mhóir agus Éire atá leagtha amach sa Dara Sgeideal a ghabhann leis seo (dá ngoirtear feasta “an Connradh Sgeidealta”) agus dá dtugtar feidhm dlí leis seo, agus má bhíonn aon fhoráil den Bhun-reacht roimh-ráite ná d'aon leasú air ná d'aon dlí a déanfar fé buiniscionn in aon tslí le aon cheann d'fhorálacha an Chonnartha Sgeidealta, beidh sé, i méid na buiniscionntachta san amháin, gan brí gan feidhm ar bith, agus rithfidh Oireachtas agus Ard-Chomhairle Shaorstáit Éireann fé seach pé reachtúchán eile agus gach n eile a bheidh riachtanach chun an Connradh Sgeidealta do thabhairt chun críche

source: This Act may be cited for all purposes as the Constitution of The Irish Free State (Saorstát Eireann) Act, 1922
ga: Chun gach críche féadfar an t-Acht um Bun-reacht Shaorstáit Éireann, 1922 , do ghairm den Acht so

source: FIRST SCHEDULE ABOVE REFERRED TO
ga: AN CHÉAD SGEIDEAL DÁ DTAGARTAR THUAS

source: The Irish Free State (otherwise hereinafter called or sometimes called Saorstát Eireann) is a co-equal member of the Community of Nations forming the British Commonwealth of Nations
ga: Ball có-ionann iseadh Saorstát Éireann den Chuideachta Náisiún a dhineann suas an Có-chiníochas Briotáineach

source: All powers of government and all authority, legislative, executive, and judicial, in Ireland are derived from the people of Ireland, and the same shall be exercised in the Irish Free State (Saorstát Eireann) through the organisations established by or under, and in accord with, this Constitution
ga: Tagann gach comhacht rialtais agus gach údarás reachtúcháin, feidhmiúcháin agus breithiúntais in Éirinn ó mhuintir na hÉireann agus feidhmeofar iad i Saorstát Éireann trí sna cóghléasanna a bunófar do réir an Bhun-reachta so no fé no leis

source: Every person, without distinction of sex, domiciled in the area of the jurisdiction of the Irish Free State (Saorstát Eireann) at the time of the coming into operation of this Constitution, who was born in Ireland or either of whose parents was born in Ireland or who has been ordinarily resident in the area of the jurisdiction of the Irish Free State (Saorstát Eireann) for not less than seven years, is a citizen of the Irish Free State (Saorstát Eireann) and shall within the limits of the jurisdiction of the Irish Free State (Saorstát Eireann) enjoy the privileges and be subject to the obligations of such citizenship: Provided that any such person being a citizen of another State may elect not to accept the citizenship hereby conferred; and the conditions governing the future acquisition and termination of citizenship in the Irish Free State (Saorstát Eireann) shall be determined by law
ga: Saoránach de Shaorstát Éireann iseadh gach duine idir fireann agus buineann ar a bhfuil buan-chomhnuí i líomatáiste údaráis Shaorstáit Éireann le linn an Bhun-reachta so do theacht i bhfeidhm agus gur in Éirinn do rugadh é féin no a athair no a mháthair no ar a raibh gnáth-chomhnuí i líomatáiste údaráis Shaorstáit Éireann ar feadh seacht mblian ar a luighead, agus, laistigh de theoranta údaráis Shaorstáit Éireann, beidh aige na príbhléidí agus tuitfidh air na hoibleagáidí a ghabhann leis an saoránacht san: Ar choiníoll go bhféadfaidh aon duine atá 'na shaoránach de Stát eile a bhreith de rogha gan an tsaoránacht a tugtar leis seo dho do ghlaca; agus socrófar le dlí na coiníollacha a rialóidh feasta saoránacht d'fháil agus do chríochnú i Saorstát Éireann

source: The National language of the Irish Free State (Saorstát Eireann) is the Irish language, but the English language shall be equally recognised as an official language
ga: Sí an Ghaedhilg teanga Náisiúnta Shaorstáit Éireann, ach có-aithneofar an Béarla mar theanga oifigiúil

source: Nothing in this Article shall prevent special provisions being made by the Parliament of the Irish Free State (otherwise called and herein generally referred to as the "Oireachtas") for districts or areas in which only one language is in general use
ga: Ní choiscfidh éinní san Airtiogal so ar an Oireachtas forálacha speisialta do dhéanamh do cheanntair no do líomatáistí ná fuil ach teanga amháin i ngnáth-úsáid ionta

source: No title of honour in respect of any services rendered in or in relation to the Irish Free State (Saorstát Eireann) may be conferred on any citizen of the Irish Free State (Saorstát Eireann) except with the approval or upon the advice of the Executive Council of the State
ga: Ní bronnfar ar aon tsaoránach de Shaorstát Éireann aon teideal onóra i dtaobh aon tseirbhísí do thabhairt uaidh i Saorstát Éireann no 'na thaobh ach le cead no ar mhola Ard-Chomhairle an Stáit

source: The liberty of the person is inviolable, and no person shall be deprived of his liberty except in accordance with law
ga: Is slán saoirse an duine, agus ní bainfear a shaoirse d'aon duine ach do réir na dlí

source: Upon complaint made by or on behalf of any person that he is being unlawfully detained, the High Court and any and every judge thereof shall forthwith enquire into the same and may make an order requiring the person in whose custody such person shall be detained to produce the body of the person so detained before such Court or judge without delay, and to certify in writing as to the cause of the detention and such Court or judge shall thereupon order the release of such person unless satisfied that he is being detained in accordance with the law: Provided, however, that nothing in this Article contained shall be invoked to prohibit, control or interfere with any act of the military forces of the Irish Free State (Saorstát Eireann) during the existence of a state of war or armed rebellion
ga: Ar aon duine do dhéanamh ghearáin no ar ghearán do dhéanamh ar a shon go bhfuiltear á chimeád go neadhleathach, fiosróidh an Ard-Chúirt agus aon bhreitheamh agus gach breitheamh di an gearán san láithreach agus féadfaid órdú do dhéanamh á chur d'fhiachaibh ar an nduine atá ag cimeád an duine sin corp an duine atá i gcimeád do thabhairt i láthair na Cúirte noan bhreithimh gan mhoill agus deimhniú do dhéanamh i scríbhinn i dtaobh cúise a chimeádtha agus órdóidh an Chúirt no an breitheamh san an duine sin do sgaoile ansan mara mbeifar sásta go bhfuiltear á chimeád do réir na dlí: Ar choiníoll, ámh le linn chogaidh no rebiliúntachta armtha ná gairmfear éinní dá bhfuil san Airtiogal so chun aon ghníomh dá ndéanfaidh fórsaí airm Shaorstáit Éireann do chosg, do smachtú ná do thoirmeasg

source: The dwelling of each citizen is inviolable and shall not be forcibly entered except in accordance with law
ga: Is slán do gach saoránach a arús comhnuithe agus ní raghfar isteach ann le fóirneart ach do réir dlí

source: Freedom of conscience and the free profession and practice of religion are, subject to public order and morality, guaranteed to every citizen, and no law may be made either directly or indirectly to endow any religion, or prohibit or restrict the free exercise thereof or give any preference, or impose any disability on account of religious belief or religious status, or affect prejudicially the right of any child to attend a school receiving public money without attending the religious instruction at the school, or make any discrimination as respects State aid between schools under the management of different religious denominations, or divert from any religious denomination or any educational institution any of its property except for the purpose of roads, railways, lighting, water or drainage works or other works of public utility, and on payment of compensation
ga: Is slán do gach saoránach saoirse choinsiais agus saor-chleachta agus admháil phuiblí chreidimh, ach gan dochar don rialtacht ná don mhoráltacht phuiblí, agus ní déanfar aon dlí go díreach ná go mí-dhíreach chun maoin do bhronna ar aon chreideamh, ná chun cosc ná teora do chur le saor-chleachta aon chreidimh, ná chun aon bhontáiste do thabhairt do dhuine ná aon mhí-ábaltacht do chur air mar gheall ar a thuairim ná a chéim a gcúrsaí creidimh ná baint go díobhálach ó cheart aon leinbh dul chun scoile atá ag fáil airgid phuiblí i dtaobh gan é bheith láithreach ag an dteagasc chreidimh sa scoil sin, ná chun aon deifríocht do dhéanamh i dtaobh cabhrach Stáit idir scoileanna atá fe bhainisteoireacht lucht chreidimh dheifriúla, ná chun aon chuid dá maoin do thógaint ó aon lucht creidimh ná ó aon fhundúireacht oideachais ach amháin chun bóithre, bóithre iarainn, oibreacha soluis, uisce no draeneála, no chun oibreacha eile d'úsáid phuiblí, agus ar chúiteamh do dhíol

source: The right of free expression of opinion as well as the right to assemble peaceably and without arms, and to form associations or unions is guaranteed for purposes not opposed to public morality
ga: Is slán ceart oipineon do chur in úil gan chosg agus ceart teacht le chéile go síochánta gan airm, agus ceart cumainn no aontaisí do bhunú ar aon toisg ná fuil i gcoinne mhoráltacht phuiblí

source: Laws regulating the manner in which the right of forming associations and the right of free assembly may be exercised shall contain no political, religious or class distinction
ga: Na dlithe a rialóidh an tslí 'na bhféadfar ceart cumainn do bhunú agus ceart saor-theacht le chéile do chur i bhfeidhm, ní dhéanfaid aon leithreachas i dtaobh polaitíochta ná creidimh ná aicme

source: All citizens of the Irish Free State (Saorstát Eireann) have the right to free elementary education
ga: Tá de cheart ag gach saoránach de Shaorstát Éireann bunoideachas d'fháil in aisce

source: All the lands and waters, mines and minerals, within the territory of the Irish Free State (Saorstát Eireann) hitherto vested in the State, or any department thereof, or held for the public use or benefit, and also all the natural resources of the same territory (including the air and all forms of potential energy), and also all royalties and franchises, within that territory shall, from and after the date of the coming into operation of this Constitution, belong to the Irish Free State (Saorstát Eireann), subject to any trusts, grants, leases or concessions then existing in respect thereof, or any valid private interest therein, and shall be controlled and administered by the Oireachtas, in accordance with such regulations and provisions as shall be from time to time approved by legislation, but the same shall not, nor shall any part thereof, be alienated, but may in the public interest be from time to time granted by way of lease or licence to be worked or enjoyed under the authority and subject to the control of the Oireachtas: Provided that no such lease or licence may be made for a term exceeding ninety-nine years, beginning from the date thereof, and no such lease or licence may be renewable by the terms thereof
ga: Gach talamh agus uisce, gach mianach agus minearál, laistigh de chrich Shaorstáit Éireann dá raibh go dtí so i seilbh an Stáit, no i seilbh aon roinne dhe, no do bhí á chimeád chun úsáide no tairbhe puiblí, agus fós gach maoin nádúrtha den chrich chéanna (mar aon leis an aer agus le gach abhar gníomh-chomhachta), agus fós gach rí-chíos agus reacht-shaoirse laistigh den chrích sin, is le Saorstát Éireann iad ó dháta an Bhun-reachta so do theacht i bhfeidhm, gan dochar d'aon mhuinghineachas, bronntas, léas, ná cead 'na dtaobh do bhí an uair sin ann, no d'aon cheart dlisteanach príobháideach 'na leith, agus smachtóidh agus riarfaidh an t-Oireachtas iad, do réir pé rialacha agus forálacha a ceadófar le reachtúchán ó am go ham, ach ní aistreofar a seilbh sin ná seilbh aon choda acu, ach féadfar chun an leasa phuiblí iad do leigeant amach ó am go ham ar léas no ar chead, chun iad d'oibriú no a dtairbhe d'fháil, fé údarás agus do réir smachta an Oireachtais: Ar choiníoll ná féadfar aon léas ná aon chead den tsórt san do dhéanamh ar théarma a raghaidh thar naoi mbliana déag is cheithre fichid ó dháta a dhéanta, agus ná féadfar de bhrí a théarmaí féin aon léas ná aon chead den tsórt san d'athnuachtaint

source: A Legislature is hereby created, to be known as the Oireachtas
ga: Bunuítear leis seo Cóir Reachtúcháin dá ngoirfear an tOireachtas

source: It shall consist of the King and two Houses, the Chamber of Deputies (otherwise called and herein generally referred to as "Dáil Eireann") and the Senate (otherwise called and herein generally referred to as "Seanad Eireann")
ga: Beidh ann an Rí agus dhá Thigh, Dáil Éireann agus Seanad Éireann

source: The sole and exclusive power of making laws for the peace, order and good government of the Irish Free State (Saorstát Eireann) is vested in the Oireachtas
ga: Is ag an Oireachtas amháin a bheidh an t-aon-chomhacht chun dlithe i dtaobh síochána, rialtachta agus dea-riartha Shaorstáit Éireann do dhéanamh

source: The Oireachtas shall sit in or near the city of Dublin or in such other place as from time to time it may determine
ga: Suidhfidh an t-Oireachtas i gcathair Bhaile Atha Cliath no 'na haice no i pé áit eile a shocróidh sé ó am go ham

source: All citizens of the Irish Free State (Saorstát Eireann) without distinction of sex, who have reached the age of twenty-one years and who comply with the provisions of the prevailing electoral laws, shall have the right to vote for members of Dáil Eireann, and to take part in the Referendum and Initiative
ga: Beidh de cheart ag gach saoránach de Shaorstát Éireann idir fireann agus buineann go mbeidh aois bhliana is fiche slán aige agus a chó-líonfaidh forálacha dlithe toghacháin na hiamsire, vótáil le teachtaí de Dháil Éireann, agus páirt do thógaint sa Referendum agus sa Tionnscnamh

source: All citizens of the Irish Free State (Saorstát Eireann) without distinction of sex who have reached the age of thirty years and who comply with the provisions of the prevailing electoral laws, shall have the right to vote for members of Seanad Eireann
ga: Beidh de cheart ag gach saoránach de Shaorstát Éireann idir fireann agus buineann go mbeidh aois deich mblian fichead slán aige agus a chó-líonfaidh forálacha dlithe toghacháin na haimsire, vótáil le baill do Sheanad Éireann

source: No voter may exercise more than one vote at an election to either House, and the voting shall be by secret ballot
ga: Ní chaithfidh aon vótálaí níos mó ná aon vóta amháin i dtoghachán d'aon cheann den dá Thigh, agus is le ballóid shicréideach a déanfar an vótáil

source: The mode and place of exercising this right shall be determined by law
ga: Socrófar le dlí an chuma agus an áit 'na mbainfear feidhm as an gceart so

source: Every citizen who has reached the age of twenty-one years and who is not placed under disability or incapacity by the Constitution or by law shall be eligible to become a member of Dáil Eireann
ga: Gach saoránach go mbeidh aois bhliana is fiche slán aige, agus ná beidh curtha fé mhí-ábaltacht ná fé mhí-chumas ag an mBunreacht ná ag an ndlí beidh sé iontoghtha chun bheith 'na theachta de Dháil Éireann

source: No person may be at the same time a member both of Dáil Eireann and of Seanad Eireann, and if any person who is already a member of either House is elected to be a member of the other House, he shall forthwith be deemed to have vacated his first seat
ga: Ní fhéadfaidh éinne bheith 'na bhall de Dháil Éireann agus de Sheanad Éireann in aonacht, agus má toghtar aon duine atá 'na bhall cheana d'aon Tigh chun bheith 'na bhall den Tigh eile, tuigfear feasta a chéad shuidheachán do bheith follamhuithe

source: The oath to be taken by members of the Oireachtas shall be in the following form:—
ga: Is sa bhfuirm seo leanas a bheidh an mhóid a thabharfaidh Baill an Oireachtais:—

source: M. King George V., his heirs and successors by law in virtue of the common citizenship of Ireland with Great Britain and her adherence to and membership of the group of nations forming the British Commonwealth of Nations
ga: Bheirim-se..............................mo mhóid go solamanta go ngéillfead agus go mbead fír-dhílis do Bhun-reacht Shaorstáit Éireann ar n-a bhunú do réir dlí, agus go mbead dílis dá Shoillse Rí Seoirse V., dá oighrí agus dá chomharbaí do réir dlí, de bhrí chó-shaoránachta na hÉireann leis an mBreatain Mhóir agus de bhrí gur ball í agus go leanann sí den chó-chruinniú náisiún a dhineann suas an Có-chiníochas Briotáineach

source: Such oath shall be taken and subscribed by every member of the Oireachtas before taking his seat therein before the Representative of the Crown or some other person authorised by him
ga: Roimh thógaint a shuideacháin san Oireachtas do, tabharfaidh gach ball an mhóid sin agus cuirfe sé a ainm léi i bhfianaise Ionadaí na Coróinneach no i bhfianaise duine éigin go mbeith a údarás aige uaidh

source: Every member of the Oireachtas shall, except in case of treason, felony, or breach of the peace, be privileged from arrest in going to and returning from, and while within the precincts of either House, and shall not, in respect of any utterance in either House, be amenable to any action or proceeding in any Court other than the House itself
ga: Beidh de phríbhléid ag gach ball den Oireachtas, ach amháin i gcás tréasúin, feleontachta no brise síochána, go mbeidh sé saor ó thógaint le linn do bheith ag dul chun aon Tighe den dá Thigh no ag teacht uaidh, no le linn do bheith fé ia aon Tighe den dá Thigh, agus ní féadfar aon aicsean ná aon imeachta in aon Chúirt ach sa Tigh féin do thabhairt 'na choinne i dtaobh éinní dá ndéarfa sé in aon Tigh den dá Thigh

source: All official reports and publications of the Oireachtas or of either House thereof shall be privileged, and utterances made in either House wherever published shall be privileged
ga: Beidh gach tuairisc agus foillsiúchán oifigiúil den Oireachtas no d'aon Tigh de fé phríbhléid agus beidh gach ní adéarfar in aon Tigh de fé phríbhléid is cuma cá bhfoillseófar é

source: Each House shall make its own Rules and Standing Orders, with power to attach penalties for their infringement and shall have power to ensure freedom of debate, to protect its official documents and the private papers of its members, and to protect itself and its members against any person or persons interfering with, molesting or attempting to corrupt its members in the exercise of their duties
ga: Déanfaidh gach Tigh a rialacha agus a Bhuan-Orduithe féin agus beidh de chomhacht aige pionós do chur i bhfeidhm i dtaobh a mbriste agus beidh de chomhacht aige saoirse dhíospóireachta do chur in áirithe, a scríbhinní oifigiúla agus páipéirí príobháideacha a bhall do chosaint agus é féin agus a bhaill do chosaint ar aon duine no daoine a bhainfidh le n-a bhaill no a chuirfidh isteach ortha no a thabharfaidh fé iad do bhrcaba le linn dóibh a ndualgaisí do chó-líona

source: Each House shall elect its own Chairman and Deputy Chairman, and shall prescribe their powers, duties, remuneration, and terms of office
ga: Déanfaidh gach Tigh a Cheann Comhairle agus a Leas-Cheann Comhairle féin do cheapa agus a gcomhachta, a ndualgaisí, a luach saothair, agus a dtéarmaí oifige do leaga amach

source: All matters in each House shall, save as otherwise provided by this Constitution, be determined by a majority of the votes of the members present other than the Chairman or presiding member, who shall have and exercise a casting vote in the case of an equality of votes
ga: Socrófar gach ceist i ngach Tigh, ach amháin mar a bhfuil a mhalairt de shocrú sa Bhun-reacht so, le mór-áireamh de vótanna na mball atá láithreach, lasmuich den Cheann Chomhairle no den bhall atá i gceannas, ag a mbeidh vóta réitigh agus ar a mbeidh é chaitheamh má's ionann vótanna an dá thaobh

source: The number of members necessary to constitute a meeting of either House for the exercise of its powers shall be determined by its Standing Orders
ga: Socróidh Buan-Orduithe gach Tighe an mó ball a dhéanfaidh cruinniú dleathach d'aon Tigh chun a chomachta do chur i bhfeidhm

source: The Oireachtas shall make provision for the payment of its members, and may in addition provide them with free travelling facilities to any part of Ireland
ga: Déanfaidh an t-Oireachtas soláthar chun a bhaill do dhíol agus féadfaidh sé fós saor-thaisteal do sholáthar dóibh in aon pháirt d'Éirinn:

source: The Oireachtas shall hold at least one session each year
ga: Tionólfaidh an t-Oireachtas siosón amháin ar a luighead gach bliain

source: The Oireachtas shall be summoned and dissolved by the Representative of the Crown in the name of the King and subject as aforesaid Dáil Eireann shall fix the date of re-assembly of the Oireachtas and the date of the conclusion of the session of each House: Provided that the sessions of Seanad Eireann shall not be concluded without its own consent
ga: Déanfaidh Ionadaí na Coróinneach in ainm an Rí an t-Oireachtas do ghairm agus do sgur agus ar na hachtaibh sin ceapfaidh Dáil Éireann dáta aith-thionóil an Oireachtias agus dáta críochnuithe shiosóin gach Tighe: Ar choiníoll ná críochnófar siosóin Sheanaid Éireann gan a thoil féin

source: Sittings of each House of the Oireachtas shall be public
ga: Beidh suidheanna gach Tighe den Oireachtas go puiblí

source: In cases of special emergency either House may hold a private sitting with the assent of two-thirds of the members present
ga: Ar ócáidí de riachtanas speisialta féadfaidh aon Tigh suidhe príobháideach do bheith aige ach dhá dtrian na mball a bheidh láithreach do thoiliú leis
